import React from "react";

import { Button, Img, Line, Text } from "components";
import { Link } from "react-router-dom";

const securityPolicy = () => {
  return (
    <>
      <div className="bg-white-A700 flex flex-col font-montserrat items-center justify-start mx-auto p-5 w-full">
        <div className="flex flex-col justify-start max-w-[1220px] mb-5 mx-auto md:px-5 w-full">
          <div className="flex flex-row sm:gap-10 items-start justify-between md:ml-[0] ml-[439px] w-[65%] md:w-full">
            <Text
              className="mt-[18px] text-2xl md:text-[22px] text-black-900 text-center sm:text-xl tracking-[0.48px]"
              size="txtMontserratSemiBold24Black900"
            >
              Политика безопасности
            </Text>
            <Img
              className="h-5 w-5"
              src="images/img_mobilecancelmajor.svg"
              alt="mobilecancelmaj"
            />
          </div>
          <div className="flex md:flex-col flex-row md:gap-5 items-start justify-evenly mr-4 mt-5 w-[99%] md:w-full">
            <div className="flex flex-col items-center justify-start">
              <Text
                className="text-black-900 text-sm"
                size="txtMontserratRegular14Black900"
              >
                <span className="text-black-900 font-montserrat text-left font-semibold">
                  <>
                    БЕЗОПАСНОСТЬ ОНЛАЙН ПЛАТЕЖЕЙ
                    <br />
                  </>
                </span>
                <span className="text-black-900 font-montserrat text-left font-normal">
                  <>
                    <br />
                  </>
                </span>
                <span className="text-black-900 font-montserrat text-left font-semibold">
                  <>
                    Платежи. Оплата банковской картой онлайн
                    <br />
                  </>
                </span>
                <span className="text-black-900 font-montserrat text-left font-normal">
                  <>
                    Наш сайт подключен к интернет-эквайрингу, и Вы можете
                    оплатить Услугу банковской картой Visa или Mastercard. После
                    подтверждения выбранного Товара либо услуги откроется
                    защищенное окно с платежной страницей процессингового центра
                    CloudPayments, где Вам необходимо ввести данные Вашей
                    банковской карты. Для дополнительной аутентификации
                    держателя карты используется протокол 3-D Secure. Если Ваш
                    Банк-эмитент поддерживает данную технологию, Вы будете
                    перенаправлены на его сервер для прохождения дополнительной
                    идентификации. Информацию о правилах и методах
                    дополнительной идентификации уточняйте в Банке, выдавшем Вам
                    банковскую карту.
                    <br />
                    <br />
                    Услуга онлайн-оплаты осуществляется в соответствии с
                    правилами Международных платежных систем Visa и MasterCard
                    на принципах соблюдения конфиденциальности и безопасности
                    совершения платежа, для этого используются самые актуальные
                    методы проверки, шифрования и передачи данных по закрытым
                    каналам связи. Ввод данных банковской карты осуществляется в
                    защищенном окне на платежной странице CloudPayments.
                    <br />
                    <br />В поля на платежной странице требуется ввести номер
                    карты, имя владельца карты, срок действия карты, трёхзначный
                    код безопасности (CVV2 для VISA или CVC2 для MasterCard).
                    Все необходимые данные отображены на поверхности банковской
                    карты.
                    <br />
                    <br />
                    CVV2/ CVC2 — это трёхзначный код безопасности, находящийся
                    на оборотной стороне карты.
                    <br />
                    <br />
                    Далее в том же окне откроется страница Вашего банка-эмитента
                    для ввода 3-D Secure кода. В случае, если у вас не настроен
                    статичный 3-D Secure, он будет отправлен на ваш номер
                    телефона посредством SMS. Если 3-D Secure код к Вам не
                    пришел, то следует обратится в ваш банк-эмитент.
                    <br />
                    <br />
                    3-D Secure — это самая современная технология обеспечения
                    безопасности платежей по картам в сети интернет. Позволяет
                    однозначно идентифицировать подлинность держателя карты,
                    осуществляющего операцию, и максимально снизить риск
                    мошеннических операций по карте.
                    <br />
                    <br />
                    Гарантии безопасности
                    <br />
                    Процессинговый центр CloudPayments защищает и обрабатывает
                    данные Вашей банковской карты по стандарту безопасности PCI
                    DSS 3.0. Передача информации в платежный шлюз происходит с
                    применением технологии шифрования SSL. Дальнейшая передача
                    информации происходит по закрытым банковским сетям, имеющим
                    наивысший уровень надежности. CloudPayments не передает
                    данные Вашей карты нам и иным третьим лицам. Для
                    дополнительной аутентификации держателя карты используется
                    протокол 3-D Secure.
                    <br />
                    <br />В случае, если у Вас есть вопросы по совершенному
                    платежу, Вы можете обратиться в службу поддержки клиентов
                    платежного сервиса по электронной почте
                    support@cloudpayments.kz.
                    <br />
                    <br />
                    Безопасность онлайн-платежей
                    <br />
                    Предоставляемая Вами персональная информация (имя, адрес,
                    телефон, e-mail, номер кредитной карты) является
                    конфиденциальной и не подлежит разглашению. Данные Вашей
                    кредитной карты передаются только в зашифрованном виде и не
                    сохраняются на нашем Web-сервере.
                    <br />
                    <br />
                    Безопасность обработки Интернет-платежей гарантирует ТОО
                    «CloudPayments Kazakhstan». Все операции с платежными
                    картами происходят в соответствии с требованиями VISA
                    International, MasterCard и других платежных систем. При
                    передаче информации используются специализированные
                    технологии безопасности карточных онлайн-платежей, обработка
                    данных ведется на безопасном высокотехнологичном сервере
                    процессинговой компании.
                    <br />
                    <br />
                    Оплата платежными картами безопасна, потому что:
                    <br />
                    <br />
                    <br />• Система авторизации гарантирует покупателю, что
                    платежные реквизиты его платежной карты (номер, срок
                    действия, CVV2/CVC2) не попадут в руки мошенников, так как
                    эти данные не хранятся на сервере авторизации и не могут
                    быть похищены.
                    <br />• Покупатель вводит свои платежные данные
                    непосредственно в системе авторизации CloudPayments, а не на
                    сайте интернет-магазина, следовательно, платежные реквизиты
                    карточки покупателя не будут доступны третьим лицам.
                    <br /> <br />
                    Конфиденциальность
                    <br />
                    <br />
                    1. Определения
                    <br />
                    Интернет проект https://worktap.kz (далее – URL, «мы»)
                    серьезно относится к вопросу конфиденциальности информации
                    своих клиентов и посетителей сайта https://worktap.kz (далее
                    – «вы», «посетители сайта»). Персонифицированной мы называем
                    информацию, содержащую персональные данные (например: ФИО,
                    логин или название компании) посетителя сайта, а также
                    информацию о действиях, совершаемых вами на сайте URL.
                    (например: заказ посетителя сайта с его контактной
                    информацией). Анонимными мы называем данные, которые
                    невозможно однозначно идентифицировать с конкретным
                    посетителем сайта (например: статистика посещаемости сайта).
                    <br />
                    <br />
                    2. Использование информации
                    <br />
                    Мы используем персонифицированную информацию конкретного
                    посетителя сайта исключительно для обеспечения ему
                    качественного оказания услуг и их учета. Мы не раскрываем
                    персонифицированных данных одних посетителей сайта URL
                    другим посетителям сайта. Мы никогда не публикуем
                    персонифицированную информацию в открытом доступе и не
                    передаем ее третьим лицам. Исключением являются лишь
                    ситуации, когда предоставление такой информации
                    уполномоченным государственным органам предписано
                    действующим законодательством Республики Казахстан. Мы
                    публикуем и распространяем только отчеты, построенные на
                    основании собранных анонимных данных. При этом отчеты не
                    содержат информацию, по которой было бы возможным
                    идентифицировать персонифицированные данные пользователей
                    услуг. Мы также используем анонимные данные для внутреннего
                    анализа, целью которого является развитие продуктов и услуг
                    URL
                    <br />
                    <br />
                    3. Ссылки
                    <br />
                    Сайт https://worktap.kz может содержать ссылки на другие
                    сайты, не имеющие отношения к нашей компании и принадлежащие
                    третьим лицам. Мы не несем ответственности за точность,
                    полноту и достоверность сведений, размещенных на сайтах
                    третьих лиц, и не берем на себя никаких обязательств по
                    сохранению конфиденциальности информации, оставленной вами
                    на таких сайтах.
                    <br />
                    <br />
                    4. Ограничение ответственности
                    <br />
                    Мы делаем все возможное для соблюдения настоящей политики
                    конфиденциальности, однако, мы не можем гарантировать
                    сохранность информации в случае воздействия факторов
                    находящихся вне нашего влияния, результатом действия которых
                    станет раскрытие информации. Сайт https://worktap.kz и вся
                    размещенная на нем информация представлены по принципу
                    &quot;как есть&quot; без каких-либо гарантий. Мы не несем
                    ответственности за неблагоприятные последствия, а также за
                    любые убытки, причиненные вследствие ограничения доступа к
                    сайту URL или вследствие посещения сайта и использования
                    размещенной на нем информации.
                    <br />
                    <br />
                    5. Контакты
                    <br />
                    По вопросам, касающимся настоящей политики, просьба
                    обращаться по адресу worktapkz@gmail.com
                    <br />
                    <br />
                    Юридическое лицо
                    <br />
                    &quot;WorkTap.kz&quot; LLC
                    <br />
                    БИН: 201240012054
                    <br />
                    010000, г. Нур-Султан
                    <br />
                    ул. Е 15, 3<br />
                    <br />
                  </>
                </span>
              </Text>
            </div>
            <Line className="bg-blue_gray-600 md:h-1 h-[71px] mb-[448px] rounded-sm w-1 md:w-full" />
          </div>
          <div className="flex md:flex-col flex-row gap-8 items-center justify-center md:ml-[0] ml-[205px] mt-[31px] w-[65%] md:w-full">
       <Link to="/">
       <Button
              className="border border-green-A700 border-solid cursor-pointer font-medium leading-[normal] min-w-[380px] sm:min-w-full rounded-[20px] text-center text-sm"
              shape="round"
              color="green_A700"
              size="sm"
              variant="fill"
            >
              Понятно
            </Button>
       </Link>
            <Button
              className="cursor-pointer flex items-center justify-center min-w-[380px] sm:min-w-full rounded-[20px]"
              rightIcon={
                <Img
                  className="h-5 mb-px ml-2"
                  src="images/img_pagedownmajor_1_1.svg"
                  alt="PageDownMajor (1) 1"
                />
              }
              shape="round"
              color="green_A700"
              size="sm"
              variant="outline"
            >
              <div className="font-medium leading-[normal] text-center text-sm">
                Скачать документ
              </div>
            </Button>
          </div>
        </div>
      </div>
    </>
  );
};

export default securityPolicy;
